examples/porousHeatTransferFoam/PCMValidations/airMassRate-discharge/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "3600";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
80
(
(0 2.87664 0)
(0 2.87678 0)
(0 2.87695 0)
(0 2.87709 0)
(0 2.87723 0)
(0 2.87737 0)
(0 2.87752 0)
(0 2.87766 0)
...
)
;

boundaryField
{
    floor
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.0722222;
        extrapolateProfile false;
        value           uniform (-0 2.87659 -0);
    }
    ceiling
    {
        type            fluxCorrectedVelocity;
        value           uniform (0 2.88794 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
