examples/porousHeatTransferFoam/PCMValidations/airMassRate-discharge/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "3600";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
80
(
100401
100396
100391
100386
100381
100376
100371
100366
...
)
;

boundaryField
{
    floor
    {
        type            fixedFluxExtrapolatedPressure;
        gradient        uniform 1549.75;
        value           uniform 100404;
    }
    ceiling
    {
        type            fixedValue;
        value           uniform 100000;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
