examples/porousHeatTransferFoam/PCMValidations/airMassRate-discharge/0.orig/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "3600";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0];
oriented        oriented;


internalField   nonuniform List<scalar> 
79
(
0.0722222
0.0722222
0.0722222
0.0722222
0.0722222
0.0722222
0.0722222
0.0722222
...
)
;

boundaryField
{
    floor
    {
        type            calculated;
        value           uniform -0.0722222;
    }
    ceiling
    {
        type            calculated;
        value           uniform 0.0722222;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
}


// ************************************************************************* //
