examples/porousHeatTransferFoam/PCMValidations/airMassRate-discharge/0.orig/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "3600";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];


internalField   nonuniform List<scalar> 
80
(
0.472875
0.472851
0.472828
0.472804
0.47278
0.472757
0.472733
0.472709
...
)
;

boundaryField
{
    floor
    {
        type            calculated;
        value           uniform 0.472887;
    }
    ceiling
    {
        type            calculated;
        value           uniform 0.471028;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
